{
  "backend/main.mo": "Main canister logic managing user profiles, posts, comments, relationships, chat conversations, and authorization with various query and update methods.",
  "backend/migration.mo": "Defines old data structures and a migration function that returns the existing state unchanged.",
  "feature_evidence.json": "Lists feature evidence metadata linking features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short descriptions for major frontend components and hooks, including new chat-related files.",
  "frontend/index.html": "Base HTML entry point loading the React app and setting metadata and icons.",
  "frontend/src/App.tsx": "Main React app component handling authentication, routing, profile checks, feed loading, and chat modal state.",
  "frontend/src/components/BaseModal.tsx": "Generic modal component providing layout, sizing, and close behavior.",
  "frontend/src/components/ChatUserPickerModal.tsx": "Modal showing a selectable list of users to start a private chat.",
  "frontend/src/components/Comment.tsx": "Comment UI component with like, reply, delete, and profile viewing interactions.",
  "frontend/src/components/CommentsSection.tsx": "Renders a comment input and list for a post, handling creation, loading states, and profile picture display. Uses queries to fetch and submit comments with optional profile navigation.",
  "frontend/src/components/CreatePostModal.tsx": "Modal for creating a new post with a textarea, character count, and submit handling via mutation. Closes on success and shows loading state while publishing.",
  "frontend/src/components/MainContent.tsx": "Displays the main feed interface with tabs, sorting, quick post input, and post list rendering. Handles quick post submission and opening the full create post modal.",
  "frontend/src/components/PostActions.tsx": "Provides like, comment toggle, and delete actions for a post with permission checks and mutation handling. Includes a confirmation flow for deletions.",
  "frontend/src/components/PostCard.tsx": "Displays a full post including header, content, actions, and optional comments section. Toggles comments visibility and loads comment count for each post.",
  "frontend/src/components/PostHeader.tsx": "Shows post author info, profile picture, name, and timestamp, generating a displayable image URL from binary data. Supports compact mode and profile navigation.",
  "frontend/src/components/PrivateChatModal.tsx": "Modal for private chat between users, showing messages, auto-scrolling, and sending new messages. Loads recipient info and highlights own messages visually.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup with username validation, image compression, and profile save mutation.",
  "frontend/src/components/PublicUserProfile.tsx": "Displays a public user profile with posts, follow/unfollow actions, and modals for followers/following.",
  "frontend/src/components/TopHeader.tsx": "Top navigation header handling login/logout, profile access, and chat button with dropdown user menu.",
  "frontend/src/components/UserAvatar.tsx": "Reusable avatar component showing an image or fallback icon with size options.",
  "frontend/src/components/UserListModal.tsx": "Modal listing followers or following users, with profile fetching and follow/unfollow controls.",
  "frontend/src/components/UserProfileModal.tsx": "User profile edit modal with username validation, image compression, and profile update submission.",
  "frontend/src/components/UserProfilePage.tsx": "Renders the logged‑in user's profile page, loading profile data, stats, posts, and handling modals for editing, followers, and following. Filters and displays the user's posts and profile info with React hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor via react‑query, refreshing dependent queries when identity changes. Handles secret admin initialization and exposes the actor instance.",
  "frontend/src/hooks/useAppState.ts": "Manages global UI state for profile views, feed tabs, sorting, and modal toggles with helper handlers. Provides simple state updates and derived authentication info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, stored identity loading, and status tracking. Wraps AuthClient setup and exposes identity through a React provider.",
  "frontend/src/hooks/usePrivateChat.ts": "Implements private chat logic including message polling, conversation initialization, and sending messages via the backend actor. Manages local message state, conversation ID, and periodic updates.",
  "frontend/src/hooks/useProfilePicture.ts": "Fetches a user's profile picture blob from the backend and converts it into a usable image URL. Caches results with react‑query and memoizes the generated URL.",
  "frontend/src/hooks/useQueries.ts": "Defines backend data queries and mutations for user profiles, posts, username checks, and lookups, with debouncing and caching optimizations. Uses the actor to load and update data through react‑query.",
  "frontend/src/hooks/useSorting.ts": "Provides sorting utilities for posts or grouped items by timestamp or like count. Returns memoized sorted arrays based on selected criteria.",
  "frontend/src/index.css": "Sets global Tailwind base styles, imports Inter font, and defines custom scrollbar and extensive glassmorphism utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/utils/dateUtils.ts": "Provides a helper to convert a nanosecond timestamp into a human‑readable relative time string.",
  "frontend/src/utils/urlParams.ts": "Contains utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind content paths and extends theme with Inter font and custom shadows.",
  "project_state.json": "Describes the project’s current state, including implemented features and pending requests related to Internet Identity and private chat."
}